{"ModuleCode":"EC3101","ModuleTitle":"Microeconomic Analysis II","Department":"Economics","ModuleDescription":"This module is a continuation of the foundation module on microeconomics. It is designed to equip students with the standard tools and techniques to analyze microeconomic issues and to prepare them to access higher level modules that utilize microeconomic analysis. The module begins with a review of several foundation topics on consumer and producer theory covered in the prerequisite course, i.e. EC2101. It then moves on to discuss the general equilibrium model, whereby consumers and producers are put together in a general equilibrium framework. After that, it covers choice over time, i.e. inter-temporal choice and choices over different states of the world, i.e. choices under uncertainty. It then continues with game theory. This topic will be discussed extensively. Coverage will include various solution concepts for one-shot games and sequential move games. Applications of the theory on the issues of oligopolistic competition, entry and entry prevention, and network economics will receive a great deal of attention. Finally, the module ends with the asymmetric information, i.e. moral hazard and adverse selection and its application on the internal organisation of the firm. Throughout the course, empirical observations and real-life cases pertaining to the issues discussed in this module are presented.","ModuleCredit":"4","Workload":"2-1-0-2-5","Prerequisite":"EC2101 AND (EC2104 OR ANY MA MODULE THAT IS NOT MA1301/MA1301FC/MA1301X OR MA1311 OR MA1312 OR MA1421)","Preclusion":"Nil","Types":["UEM"],"History":[{"Semester":1,"ExamDate":"2018-11-29T17:00+0800","LecturePeriods":["Wednesday Afternoon"],"TutorialPeriods":["Monday Afternoon","Tuesday Afternoon","Wednesday Afternoon","Thursday Morning","Friday Morning","Friday Afternoon"]},{"Semester":2,"ExamDate":"2019-05-03T14:30+0800","LecturePeriods":["Friday Morning"],"TutorialPeriods":["Tuesday Morning","Wednesday Morning","Friday Afternoon","Monday Afternoon","Monday Morning","Tuesday Afternoon"]}]}