{"ModuleCode":"EC4302","ModuleTitle":"Macroeconomic Analysis III","Department":"Economics","ModuleDescription":"This module is divided into two sections; long- and short- run macro-economic analysis. In the first section, we shall discuss various theories of economic growth using inter-temporal optimization models, which include neo-classical growth models and overlapping-generations models. In the second section, we shall add stochastic elements to the standard neo-classical growth model and use it to study business cycles. Our focus will be to highlight the similarities and differences between the Real Business Cycle and New-Keynesian Models. This course is suitable for students intending to pursue graduate studies or quantitative research (in ministries, statutory boards, etc.) in Economics.","ModuleCredit":"5","Workload":"0-3-0-3-6.5","Prerequisite":"Cohort 2011 and before: Completed 80 MCs, including 28 MCs in EC, with a minimum CAP of 3.50 or be on the Honours track . Min avg grade point for EC3101 and EC3102 together of 4.00. Note: If student do not have the current pre-requisites for EC4301/EC4101 and EC4302/EC4102 but have: 1. passed at least 14 EC modules (or 56MCs) (inclusive of EC3101 and EC3102, and; 2. obtained an SJAP (avg grade of all EC modules) of at least 3.50, then student may submit an appeal for the prerequisite waiver using CORS. Cohort 2012 onwards: Completed 80 MCs, including 28 MCs in EC, with a minimum CAP of 3.20 or be on the Honours track. Min avg grade point for EC3101 and EC3102 together of 4.00. Note: If student do not have the current pre-requisites for EC4301/EC4101 and EC4302/EC4102 but have: 1. passed at least 14 EC modules (or 56MCs) (inclusive of EC3101 and EC3102, and; 2. obtained an SJAP (avg grade of all EC modules) of at least 3.50, then student may submit an appeal for the prerequisite waiver using CORS.","Preclusion":"EC4102","Types":["Module"],"History":[{"Semester":1,"ExamDate":"2018-12-03T09:00+0800","LecturePeriods":["Wednesday Morning"]},{"Semester":2,"ExamDate":"2019-04-30T09:00+0800","LecturePeriods":["Wednesday Morning"]}]}