{"ModuleCode":"IS3103","ModuleTitle":"Information Systems Leadership and Communication","Department":"Information Systems & Analytics","ModuleDescription":"Today’s technology leaders need to have a deep understanding of business fundamentals, recognize the key drivers of innovation, and develop effective leadership to align and integrate novel technologies and business processes for successful products and services. The course will not only cover major topics relating strategic, tactical and operational facets of thought leadership in propelling IT implementations, adoptions and changes in organization but also equip students with industry-relevant communication skillsets. The strategic facet will explore the various contexts, complex issues and dynamic paths that evoke leadership in information systems, including technology championship, disruptive technology, and IT ecosystem. The tactical facet will strategize a culture to co-create value and nurture technological innovations. Students will be taught effective communication skills for influential communication, change management communication and directional communication. These skillsets will enable them to foster partnership between technology and business stakeholders such as vendors, IT professionals and functional users. The operational facet will include leadership areas in IT portfolio management, change management, and IT applications. Through a synthesis of critical knowledge areas required of technology leaders, students will examine the intersection of technology and business to drive IT-enabled changes in an organization. The course will prepare students for senior technology positions, and develop core communication skills that leaders need to be equipped with to be successful in leading technological transformations.","ModuleCredit":"4","Workload":"2-1-3-2-2","Prerequisite":"(IS1103 or equivalent) and (CS2101 or IS2101)","Preclusion":"IS3101","Types":["Module"],"History":[{"Semester":1,"LecturePeriods":["Thursday Morning"],"TutorialPeriods":["Wednesday Morning","Tuesday Afternoon","Thursday Afternoon","Thursday Morning"]},{"Semester":2,"LecturePeriods":["Thursday Morning"],"TutorialPeriods":["Wednesday Morning","Thursday Afternoon","Monday Afternoon","Tuesday Afternoon","Monday Morning","Friday Morning","Thursday Morning"]}]}